/*!
 ******************************************************************************
 ** \file
 ** Название: Комплекс программных средств моделирования применения сил и средств ВКО.\n
 ** Разработчик: Военный институт (научно-исследовательский) Военно-космической
 ** академии имени А.Ф.Можайского.\n
 ** Файл: datum.h.\n
 ** Описание:\n
 ** Платформа: Независимо.\n
 ** Дата создания:\n
 ** История:\n
 ** Проверено: Windows 7, Ubuntu 13.04.\n
 ** Замечания:
 **
 **
 *****************************************************************************/

#ifndef DATUM_H
#define DATUM_H

#include <iostream>
#include <fstream>
//#include <stdlib.h>
#include <QString>
#include <math.h>

#include <QVector>



/*!
 * \brief Класс, описывающий кривизну поверхности Земли.
 */
class CDatum
{
public:
	//! \brief Конструктор по умолчанию. Создает недействительный датум.
	CDatum() :
		name("invalid"), description("invalid"), a(0.0), f(0.0), m(0.0),
				gm(0.0), c(0.0), omega(0.0), delta(3, 0.0), epsilon(3, 0.0)
	{
	}

	/*!
	 *  \brief Конструктор.
	 *
	 * \param name - Наименование.
	 * \param description - Описание.
	 * \param a - Большая ось эллипсоида в метрах.
	 * \param f - Уплощение (1/f).
	 * \param m - Масштабный коэффициент.
	 * \param gm - Гравитационная постоянная Земли (x10^8 m^3*s^-2).
	 * \param c - Скорость света в вакууме, м/с.
	 * \param omega - Угловая скорость (x10^-11 рад/с).
	 * \param dx - Смещение центра масс вдоль оси 0x.
	 * \param dy - Смещение центра масс вдоль оси 0y.
	 * \param dz - Смещение центра масс вдоль оси 0z.
	 * \param ex - Угол вращения вокруг оси 0x.
	 * \param ey - Угол вращения вокруг оси 0y.
	 * \param ez - Угол вращения вокруг оси 0z.
	 */
    CDatum(const QString& name, const QString& description,
			const double& a, const double& f, const double& m,
			const double& gm, const double& c, const double& omega,
			const double& dx, const double& dy, const double& dz,
			const double& ex, const double& ey, const double& ez);

	/*
	 * \brief Метод для вывода дампа.
	 *
	 * \param s - \todo описаине.
	 */
//	void dump(std::ostream& s) const;

	//! \brief Получение наименования.
    QString get_name() const
	{
		return name;
	}

	//! \brief Получение описания.
    QString get_desc() const
	{
		return description;
	}

	//! \brief Получение большой оси эллипсоида.
	double get_a() const
	{
		return a;
	}

	//! \brief Получение уплощения.
	double get_f() const
	{
		return f;
	}

	//! \brief Получение масштабного коэффициента.
	double get_m() const
	{
		return m;
	}

	//! \brief Получение гравитационной постоянной.
	double get_gm() const
	{
		return gm;
	}

	//! \brief Получение скорости света.
	double get_c() const
	{
		return c;
	}

	//! \brief Получение угловой скорости.
	double get_omega() const
	{
		return omega;
	}

	//! \brief Получение смещения центра масс.
	QVector<double> get_delta() const
	{
		return delta;
	}

	//! \brief Получение поворота центра масс.
	QVector<double> get_epsilon() const
	{
		return epsilon;
	}

	//! \brief Получение малой оси эллипсоида.
	double get_b() const
	{
		return ((1.0 - get_f()) * a);
	}

	//! \brief Получение эксцентриситета.
	double get_e() const
	{
		return ((sqrt(pow(get_a(), 2.0) - (pow(get_b(), 2.0))))
				/ get_a());
	}

	//! \brief Деструктор.
	virtual ~CDatum()
	{
	}
	;

private:
    QString name; //! Наименование датума.
    QString description; //! Описание.
	double a; //! Большая ось эллипсоида в метрах.
	double f; //! Уплощение (1/f).
	double m; //! Масштабный коэффициент.
	double gm; //! Гравитационная постоянная Земли (x10^8 m^3*s^-2).
	double c; //! Скорость света в вакууме, м/с.
	double omega; //! Угловая скорость (x10^-11 рад/с).
	QVector<double> delta; //! Смещение центра масс Земли (3 координаты, в метрах).
	QVector<double> epsilon; //! Вращение центра масс Земли (3 угла, в радианах).

}; // End of class Datum

//! потоковый оператор вывода
//std::ostream& operator<<(std::ostream& s, const CDatum& myDatum);

// Список датумов

/** WGS84
 */
const CDatum WGS84("WGS-84", "World Geodetic System 1984", 6378137.0,
		298.257223563, 0.0, 3986004.418, 299792458.0, 7292115.0, 0.0, 0.0, 0.0,
		0.0, 0.0, 0.0);

/** WGS72
 */
const CDatum WGS72("WGS-72", "World Geodetic System 1984", 6378135.0, 298.26,
		0.220, 3986004.418, 299792458.0, 7292115.0, 0.0, 0.0, 4.5, 0.0, 0.0,
		-0.5540);

/** ETH90
 */
const CDatum ETH90("ETH-90", "Earth-90-GLONASS Coordinate System", 6378136.0,
		298.257839303, 0.0, 3986004.418, 299792458.0, 7292115.0, 0.0, 0.0, 4.0,
		0.0, 0.0, 0.0);

/** ADI-M
 */
const CDatum ADI_M("ADI-M", "Adindan - Mean Solution (Ethiopia & Sudan)",
		6378249.145, 293.465, 0.0, 3986004.418, 299792458.0, 7292115.0, -166.0,
		-15.0, 204.0, 0.0, 0.0, 0.0);

/** ADI-E
 */
const CDatum ADI_E("ADI-E", "Adindan - Burkina Faso", 6378249.145, 293.465,
		0.0, 3986004.418, 299792458.0, 7292115.0, -118.0, -14.0, 218.0, 0.0,
		0.0, 0.0);

/** ADI-F
 */
const CDatum
		ADI_F("ADI-F", "Adindan - Cameroon", 6378249.145, 293.465, 0.0,
				3986004.418, 299792458.0, 7292115.0, -134.0, -2.0, 210.0, 0.0,
				0.0, 0.0);

/** ADI-A
 */
const CDatum ADI_A("ADI-A", "Adindan - Ethiopia", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -165.0, -11.0, 206.0, 0.0, 0.0,
		0.0);

/** ADI-C
 */
const CDatum ADI_C("ADI-C", "Adindan - Mali", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -123.0, -20.0, 220.0, 0.0, 0.0,
		0.0);

/** ADI-D
 */
const CDatum ADI_D("ADI-D", "Adindan - Senegal", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -128.0, -18.0, 224.0, 0.0, 0.0,
		0.0);

/** ADI-B
 */
const CDatum ADI_B("ADI-B", "Adindan - Sudan", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -161.0, -14.0, 205.0, 0.0, 0.0,
		0.0);

/** AFG
 */
const CDatum
		AFG("AFG", "Afgooye - Somalia", 6378245.0, 298.3, 0.0, 3986004.418,
				299792458.0, 7292115.0, -43.0, -163.0, 45.0, 0.0, 0.0, 0.0);

/** ARF-M
 */
const CDatum ARF_M("ARF-M", "ARC 1950 - Mean (Botswana, Lesotho, Malawi,"
	" Swaziland, Zaire, Zambia, Zimbabwe)", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -143.0, -90.0, -294.0, 0.0, 0.0,
		0.0);

/** ARF-A
 */
const CDatum ARF_A("ARF-A", "ARC 1950 - Botswana", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -138.0, -105.0, -289.0, 0.0, 0.0,
		0.0);

/** ARF-H
 */
const CDatum ARF_H("ARF-H", "ARC 1950 - Burundi", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -153.0, -5.0, -292.0, 0.0, 0.0,
		0.0);

/** ARF-B
 */
const CDatum ARF_B("ARF-B", "ARC 1950 - Lesotho", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -125.0, -108.0, -295.0, 0.0, 0.0,
		0.0);

/** ARF-C
 */
const CDatum ARF_C("ARF-C", "ARC 1950 - Malawi", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -161.0, -73.0, -317.0, 0.0, 0.0,
		0.0);

/** ARF-D
 */
const CDatum ARF_D("ARF-D", "ARC 1950 - Swaziland", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -134.0, -105.0, -295.0, 0.0, 0.0,
		0.0);

/** ARF-E
 */
const CDatum ARF_E("ARF-E", "ARC 1950 - Zaire", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -169.0, -19.0, -278.0, 0.0, 0.0,
		0.0);

/** ARF-F
 */
const CDatum ARF_F("ARF-F", "ARC 1950 - Zambia", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -147.0, -74.0, -283.0, 0.0, 0.0,
		0.0);

/** ARF-G
 */
const CDatum ARF_G("ARF-G", "ARC 1950 - Zimbabwe", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -142.0, -96.0, -293.0, 0.0, 0.0,
		0.0);

/** ARS
 */
const CDatum ARS("ARS", "ARC 1960 - Mean (Kenya, Tanzania)", 6378249.145,
		293.465, 0.0, 3986004.418, 299792458.0, 7292115.0, -160.0, -6.0,
		-302.0, 0.0, 0.0, 0.0);

/** PHA
 */
const CDatum PHA("PHA", "Ayabelle Lighthouse - Djibouti", 6378249.145, 293.465,
		0.0, 3986004.418, 299792458.0, 7292115.0, -79.0, -129.0, -145.0, 0.0,
		0.0, 0.0);

/** BID
 */
const CDatum
		BID("BID", "Bissau - Guinea- Bissau", 6378388.0, 297.0, 0.0,
				3986004.418, 299792458.0, 7292115.0, -173.0, 253.0, 27.0, 0.0,
				0.0, 0.0);

/** CAP
 */
const CDatum CAP("CAP", "Cape - South Africa", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -136.0, -108.0, -292.0, 0.0, 0.0,
		0.0);

/** CGE
 */
const CDatum CGE("CGE", "Carthage - Tunisia", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -263.0, 6.0, 431.0, 0.0, 0.0, 0.0);

/** DAL
 */
const CDatum DAL("DAL", "Dabola - Guinea", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -83.0, 37.0, 124.0, 0.0, 0.0, 0.0);

/** LEH
 */
const CDatum
		LEH("LEH", "Leigon - Ghana", 6378249.145, 293.465, 0.0, 3986004.418,
				299792458.0, 7292115.0, -130.0, 29.0, 364.0, 0.0, 0.0, 0.0);

/** LIB
 */
const CDatum LIB("LIB", "Liberia 1964", 6378249.145, 293.465, 0.0, 3986004.418,
		299792458.0, 7292115.0, -90.0, 40.0, 88.0, 0.0, 0.0, 0.0);

/** MAS
 */
const CDatum MAS("MAS", "Massawa - Eritrea (Ethiopia)", 6377397.155,
		299.1528128, 0.0, 3986004.418, 299792458.0, 7292115.0, 639.0, 405.0,
		60.0, 0.0, 0.0, 0.0);

/** MER
 */
const CDatum MER("MER", "Merchich - Morocco", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, 31.0, 146.0, 47.0, 0.0, 0.0, 0.0);

/** MIN-A
 */
const CDatum
		MIN_A("MIN-A", "Minna - Cameroon", 6378249.145, 293.465, 0.0,
				3986004.418, 299792458.0, 7292115.0, -81.0, -84.0, 115.0, 0.0,
				0.0, 0.0);

/** MIN-B
 */
const CDatum
		MIN_B("MIN-B", "Minna - Nigeria", 6378249.145, 293.465, 0.0,
				3986004.418, 299792458.0, 7292115.0, -92.0, -93.0, 122.0, 0.0,
				0.0, 0.0);

/** MPO
 */
const CDatum
		MPO("MPO", "M'Poraloko - Gabon", 6378249.145, 293.465, 0.0,
				3986004.418, 299792458.0, 7292115.0, -74.0, -130.0, 42.0, 0.0,
				0.0, 0.0);

/** NSD
 */
const CDatum NSD("NSD", "North Sahara 1959 - Algeria", 6378249.145, 293.465,
		0.0, 3986004.418, 299792458.0, 7292115.0, -186.0, -93.0, 310.0, 0.0,
		0.0, 0.0);

/** OEG
 */
const CDatum OEG("OEG", "Old Egyptian 1907 - Egypt", 6378200.0, 298.3, 0.0,
		3986004.418, 299792458.0, 7292115.0, -130.0, 110.0, -13.0, 0.0, 0.0,
		0.0);

/** PTB
 */
const CDatum PTB("PTB", "Point 58 - Mean Solution (Burkina Faso & Niger)",
		6378249.145, 293.465, 0.0, 3986004.418, 299792458.0, 7292115.0, -106.0,
		-129.0, 165.0, 0.0, 0.0, 0.0);

/** PTN
 */
const CDatum PTN("PTN", "Pointe Noire 1948 - Congo", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -148.0, 51.0, -291.0, 0.0, 0.0,
		0.0);

/** SCK
 */
const CDatum
		SCK("SCK", "Schwarzeck - Namibia", 6377397.155, 299.1528128, 0.0,
				3986004.418, 299792458.0, 7292115.0, 616.0, 97.0, -251.0, 0.0,
				0.0, 0.0);

/** VOR
 */
const CDatum VOR("VOR", "Voirol 1960 - Algeria", 6378249.145, 293.465, 0.0,
		3986004.418, 299792458.0, 7292115.0, -123.0, -206.0, 219.0, 0.0, 0.0,
		0.0);

/** AIN-A
 */
const CDatum AIN_A("AIN-A", "Ain El Abd 1970 - Bahrain Island", 6378388.0,
		297.0, 0.0, 3986004.418, 299792458.0, 7292115.0, -150.0, -250.0, -1.0,
		0.0, 0.0, 0.0);

/** AIN-B
 */
const CDatum AIN_B("AIN-B", "Ain El Abd 1970 - Saudi Arabia", 6378388.0, 297.0,
		0.0, 3986004.418, 299792458.0, 7292115.0, -143.0, -236.0, 7.0, 0.0,
		0.0, 0.0);

/** BAT
 */
const CDatum BAT("BAT", "Djakarta (Batavia) - Sumatra (Indonesia)",
		6377397.155, 299.1528128, 0.0, 3986004.418, 299792458.0, 7292115.0,
		-377.0, 681.0, -50.0, 0.0, 0.0, 0.0);

/** HKD
 */
const CDatum HKD("HKD", "Hong Kong 1963 - Hong Kong", 6378388.0, 297.0, 0.0,
		3986004.418, 299792458.0, 7292115.0, -156.0, -271.0, -189.0, 0.0, 0.0,
		0.0);

/** HTN
 */
const CDatum HTN("HTN", "Hu-Tzu-Shan - Taiwan", 6378388.0, 297.0, 0.0,
		3986004.418, 299792458.0, 7292115.0, -637.0, -549.0, -203.0, 0.0, 0.0,
		0.0);

/** IND-B
 */
const CDatum
		IND_B("IND-B", "Indian - Bangladesh", 6377276.345, 300.8017, 0.0,
				3986004.418, 299792458.0, 7292115.0, 282.0, 726.0, 254.0, 0.0,
				0.0, 0.0);

/** IND-I
 */
const CDatum IND_I("IND-I", "Indian - India & Nepal", 6377301.243, 300.8017,
		0.0, 3986004.418, 299792458.0, 7292115.0, 295.0, 736.0, 257.0, 0.0,
		0.0, 0.0);

/** INF-A
 */
const CDatum INF_A("INF-A", "Indian 1954 - Thailand", 6377276.345, 300.8017,
		0.0, 3986004.418, 299792458.0, 7292115.0, 217.0, 823.0, 299.0, 0.0,
		0.0, 0.0);

/** ING-A
 */
const CDatum ING_A("ING-A", "Indian 1960 - Vietnam (near 16N)", 6377276.345,
		300.8017, 0.0, 3986004.418, 299792458.0, 7292115.0, 198.0, 881.0,
		317.0, 0.0, 0.0, 0.0);

/** ING-B
 */
const CDatum ING_B("ING-B", "Indian 1960 - Con Son Island (Vietnam)",
		6377276.345, 300.8017, 0.0, 3986004.418, 299792458.0, 7292115.0, 182.0,
		915.0, 344.0, 0.0, 0.0, 0.0);

/** INH-A
 */
const CDatum INH_A("INH-A", "Indian 1975 - Thailand", 6377276.345, 300.8017,
		0.0, 3986004.418, 299792458.0, 7292115.0, 209.0, 818.0, 290.0, 0.0,
		0.0, 0.0);

/** IDN
 */
const CDatum IDN("IDN", "Indonesian 1974", 6378160.0, 298.247, 0.0,
		3986004.418, 299792458.0, 7292115.0, -24.0, -15.0, 5.0, 0.0, 0.0, 0.0);

/** KAN
 */
const CDatum KAN("KAN", "Kandawala - Sri Lanka", 6377276.345, 300.8017, 0.0,
		3986004.418, 299792458.0, 7292115.0, -97.0, 787.0, 86.0, 0.0, 0.0, 0.0);

/** KEA
 */
const CDatum KEA("KEA", "Kertau 1948 - West Malaysia & Singapore", 6377304.063,
		300.8017, 0.0, 3986004.418, 299792458.0, 7292115.0, -11.0, 851.0, 5.0,
		0.0, 0.0, 0.0);

/** NAH-A
 */
const CDatum NAH_A("NAH-A", "Nahrwan - Masirah Island (Oman)", 6378249.145,
		293.465, 0.0, 3986004.418, 299792458.0, 7292115.0, -247.0, -148.0,
		369.0, 0.0, 0.0, 0.0);

/** NAH-B
 */
const CDatum NAH_B("NAH-B", "Nahrwan - United Arab Emirates", 6378249.145,
		293.465, 0.0, 3986004.418, 299792458.0, 7292115.0, -249.0, -156.0,
		381.0, 0.0, 0.0, 0.0);

/** NAH-C
 */
const CDatum NAH_C("NAH-C", "Nahrwan - Saudi Arabia", 6378249.145, 293.465,
		0.0, 3986004.418, 299792458.0, 7292115.0, -243.0, -192.0, 477.0, 0.0,
		0.0, 0.0);

/** FAH
 */
const CDatum FAH("FAH", "Oman", 6378249.145, 293.465, 0.0, 3986004.418,
		299792458.0, 7292115.0, -346.0, -1.0, 224.0, 0.0, 0.0, 0.0);

/** QAT
 */
const CDatum QAT("QAT", "Qatar National - Qatar", 6378388.0, 297.0, 0.0,
		3986004.418, 299792458.0, 7292115.0, -128.0, -283.0, 22.0, 0.0, 0.0,
		0.0);

/** SOA
 */
const CDatum SOA("SOA", "South Asia - Singapore", 6378155.0, 298.3, 0.0,
		3986004.418, 299792458.0, 7292115.0, 7.0, -10.0, -26.0, 0.0, 0.0, 0.0);

/** TIL
 */
const CDatum TIL("TIL", "Timbalai 1948 - Brunei"
	" & East Malaysia (Sarawac & Sabah)", 6377298.556, 300.8017, 0.0,
		3986004.418, 299792458.0, 7292115.0, -679.0, 669.0, -48.0, 0.0, 0.0,
		0.0);

/** TOY-M
 */
const CDatum TOY_M("TOY-M", "Tokyo - Mean Solution"
	" (Japan, Okinawa & South Korea)", 6377397.155, 299.1528128, 0.0,
		3986004.418, 299792458.0, 7292115.0, -148.0, 507.0, 685.0, 0.0, 0.0,
		0.0);

/** TOY-A
 */
const CDatum TOY_A("TOY-A", "Tokyo - Japan", 6377397.155, 299.1528128, 0.0,
		3986004.418, 299792458.0, 7292115.0, -148.0, 507.0, 685.0, 0.0, 0.0,
		0.0);

/** TOY-C
 */
const CDatum TOY_C("TOY-C", "Tokyo - Okinawa", 6377397.155, 299.1528128, 0.0,
		3986004.418, 299792458.0, 7292115.0, -158.0, 507.0, 676.0, 0.0, 0.0,
		0.0);

/** TOY-B
 */
const CDatum TOY_B("TOY-B", "Tokyo - South Korea", 6377397.155, 299.1528128,
		0.0, 3986004.418, 299792458.0, 7292115.0, -146.0, 507.0, 687.0, 0.0,
		0.0, 0.0);

/** AUA
 */
const CDatum AUA("AUA", "Australian Geodetic 1966 - Australia & Tasmania",
		6378160.0, 298.25, 0.0, 3986004.418, 299792458.0, 7292115.0, -133.0,
		-48.0, 148.0, 0.0, 0.0, 0.0);

/** AUG
 */
const CDatum AUG("AUG", "Australian Geodetic 1984 - Australia & Tasmania",
		6378160.0, 298.25, 0.0, 3986004.418, 299792458.0, 7292115.0, -134.0,
		-48.0, 149.0, 0.0, 0.0, 0.0);

/** EUR-M
 */
const CDatum EUR_M("EUR-M", "European 1950 - Mean"
	" (AU, B, DK, FN, F, G, GR, I, LUX, NL, N, P, E, S, CH", 6378388.0, 297.0,
		0.0, 3986004.418, 299792458.0, 7292115.0, -87.0, -98.0, -121.0, 0.0,
		0.0, 0.0);

/** EUR-A
 */
const CDatum EUR_A("EUR-A", "European 1950 - Western Europe"
	" (AU, DK, FR, G, NL, CH", 6378388.0, 297.0, 0.0, 3986004.418, 299792458.0,
		7292115.0, -87.0, -96.0, -120.0, 0.0, 0.0, 0.0);

/** EUR-E
 */
const CDatum EUR_E("EUR-E", "European 1950 - Cyprus", 6378388.0, 297.0, 0.0,
		3986004.418, 299792458.0, 7292115.0, -104.0, -101.0, -140.0, 0.0, 0.0,
		0.0);

/** EUR-F
 */
const CDatum EUR_F("EUR-F", "European 1950 - Egypt", 6378388.0, 297.0, 0.0,
		3986004.418, 299792458.0, 7292115.0, -130.0, -117.0, -151.0, 0.0, 0.0,
		0.0);

/** EUR-G
 */
const CDatum EUR_G("EUR-G", "European 1950 - England, Wales,"
	" Scotland & Channel Islands", 6378388.0, 297.0, 0.0, 3986004.418,
		299792458.0, 7292115.0, -86.0, -96.0, -120.0, 0.0, 0.0, 0.0);

/** EUR-K
 */
const CDatum EUR_K("EUR-K", "European 1950 - England, Wales,"
	" Scotland & Ireland", 6378388.0, 297.0, 0.0, 3986004.418, 299792458.0,
		7292115.0, -86.0, -96.0, -120.0, 0.0, 0.0, 0.0);

/** EUR-B
 */
const CDatum EUR_B("EUR-B", "European 1950 - Greece", 6378388.0, 297.0, 0.0,
		3986004.418, 299792458.0, 7292115.0, -84.0, -95.0, -130.0, 0.0, 0.0,
		0.0);

/** EUR-H
 */
const CDatum EUR_H("EUR-H", "European 1950 - Iran", 6378388.0, 297.0, 0.0,
		3986004.418, 299792458.0, 7292115.0, -117.0, -132.0, -164.0, 0.0, 0.0,
		0.0);

/** EUR-I
 */
const CDatum EUR_I("EUR-I", "European 1950 - Italy - Sardinia", 6378388.0,
		297.0, 0.0, 3986004.418, 299792458.0, 7292115.0, -97.0, -103.0, -120.0,
		0.0, 0.0, 0.0);

/** EUR-J
 */
const CDatum EUR_J("EUR-J", "European 1950 - Italy - Sicily", 6378388.0, 297.0,
		0.0, 3986004.418, 299792458.0, 7292115.0, -97.0, -88.0, -135.0, 0.0,
		0.0, 0.0);

/** EUR-L
 */
const CDatum EUR_L("EUR-L", "European 1950 - Malta", 6378388.0, 297.0, 0.0,
		3986004.418, 299792458.0, 7292115.0, -107.0, -88.0, -149.0, 0.0, 0.0,
		0.0);

/** EUR-C
 */
const CDatum EUR_C("EUR-C", "European 1950 - Norway & Finland", 6378388.0,
		297.0, 0.0, 3986004.418, 299792458.0, 7292115.0, -87.0, -95.0, -120.0,
		0.0, 0.0, 0.0);

/** EUR-D
 */
const CDatum EUR_D("EUR-D", "European 1950 - Portugal & Spain", 6378388.0,
		297.0, 0.0, 3986004.418, 299792458.0, 7292115.0, -84.0, -107.0, -120.0,
		0.0, 0.0, 0.0);

/** EUR-T
 */
const CDatum EUR_T("EUR-T", "European 1950 - Tunisia", 6378388.0, 297.0, 0.0,
		3986004.418, 299792458.0, 7292115.0, -112.0, -77.0, -145.0, 0.0, 0.0,
		0.0);

/** EUS
 */
const CDatum EUS("EUS", "European 1979 - Mean Solution"
	" (AU, FN, NL, N, E, S, CH", 6378388.0, 297.0, 0.0, 3986004.418,
		299792458.0, 7292115.0, -86.0, -98.0, -119.0, 0.0, 0.0, 0.0);

/** HJO
 */
const CDatum HJO("HJO", "Hjorsey 1955 - Iceland", 6378388.0, 297.0, 0.0,
		3986004.418, 299792458.0, 7292115.0, -73.0, 46.0, -86.0, 0.0, 0.0, 0.0);

/** IRL
 */
const CDatum IRL("IRL", "Ireland 1965", 6377340.189, 299.3249646, 0.0,
		3986004.418, 299792458.0, 7292115.0, 506.0, -122.0, 611.0, 0.0, 0.0,
		0.0);

/** OGB-M
 */
const CDatum OGB_M("OGB-M", "Ordnance Survey of GB 1936 - Mean"
	" (E, IoM, S, Shl, W)", 6377563.396, 299.3249646, 0.0, 3986004.418,
		299792458.0, 7292115.0, 375.0, -111.0, 431.0, 0.0, 0.0, 0.0);

/** OGB-A
 */
const CDatum OGB_A("OGB-A", "Ordnance Survey of GB 1936 - England",
		6377563.396, 299.3249646, 0.0, 3986004.418, 299792458.0, 7292115.0,
		371.0, -112.0, 434.0, 0.0, 0.0, 0.0);

/** OGB-B
 */
const CDatum OGB_B("OGB-B", "Ordnance Survey of GB 1936 - England,"
	" Isle of Man & Wales", 6377563.396, 299.3249646, 0.0, 3986004.418,
		299792458.0, 7292115.0, 371.0, -111.0, 434.0, 0.0, 0.0, 0.0);

/** OGB-C
 */
const CDatum OGB_C("OGB-C", "Ordnance Survey of GB 1936 - Scotland"
	" & Shetland Island", 6377563.396, 299.3249646, 0.0, 3986004.418,
		299792458.0, 7292115.0, 384.0, -111.0, 425.0, 0.0, 0.0, 0.0);

/** OGB-D
 */
const CDatum OGB_D("OGB-D", "Ordnance Survey of GB 1936 - Wales", 6377563.396,
		299.3249646, 0.0, 3986004.418, 299792458.0, 7292115.0, 370.0, -108.0,
		434.0, 0.0, 0.0, 0.0);

/** MOD
 */
const CDatum MOD("MOD", "Rome 1940 - Sardinia Island", 6378388.0, 297.0, 0.0,
		3986004.418, 299792458.0, 7292115.0, -225.0, -65.0, 9.0, 0.0, 0.0, 0.0);

/** SPK
 */
const CDatum
		SPK("SPK", "S-42 (Pulkovo 1942) - Hungary", 6378245.0, 298.3, 0.0,
				3986004.418, 299792458.0, 7292115.0, 28.0, -121.0, -77.0, 0.0,
				0.0, 0.0);

/** CCD
 */
const CDatum CCD("CCD", "S-JTSK Czechoslovakia (prior to 1 Jan 1993",
		6377397.155, 299.1528128, 0.0, 3986004.418, 299792458.0, 7292115.0,
		589.0, 76.0, 480.0, 0.0, 0.0, 0.0);

///** CAC
// */
//const CDatum CAC("CAC", "Cape Canaveral - Mean Solution (Florida & Bahamas)",
//		6378206.400, 294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0,
//		-2.0, 151.0, 181.0, 0.0, 0.0, 0.0);

/** NAS-C
 */
const CDatum NAS_C("NAS-C", "N. American 1927 - Mean Solution (CONUS)",
		6378206.400, 294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0,
		-8.0, 160.0, 176.0, 0.0, 0.0, 0.0);

/** NAS-B
 */
const CDatum NAS_B("NAS-B", "N. American 1927 - Western US", 6378206.400,
		294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0, -8.0, 159.0,
		175.0, 0.0, 0.0, 0.0);

/** NAS-A
 */
const CDatum NAS_A("NAS-A", "N. American 1927 - Eastern US", 6378206.400,
		294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0, -9.0, 161.0,
		179.0, 0.0, 0.0, 0.0);

/** NAS-D
 */
const CDatum NAS_D("NAS-D", "N. American 1927 - Alaska"
	" (excluding Aleutian Islands)", 6378206.400, 294.9786982, 0.0,
		3986004.418, 299792458.0, 7292115.0, -5.0, 135.0, 172.0, 0.0, 0.0, 0.0);

/** NAS-V
 */
const CDatum NAS_V("NAS-V", "N. American 1927"
	" - Aleutian Islands East of 180W", 6378206.400, 294.9786982, 0.0,
		3986004.418, 299792458.0, 7292115.0, -2.0, 152.0, 149.0, 0.0, 0.0, 0.0);

/** NAS-W
 */
const CDatum NAS_W("NAS-W", "N. American 1927"
	" - Aleutian Islands West of 180W", 6378206.400, 294.9786982, 0.0,
		3986004.418, 299792458.0, 7292115.0, 2.0, 204.0, 105.0, 0.0, 0.0, 0.0);

/** NAS-Q
 */
const CDatum NAS_Q("NAS-Q", "N. American 1927 - Bahamas"
	" (excluding San Salvador Island", 6378206.400, 294.9786982, 0.0,
		3986004.418, 299792458.0, 7292115.0, -4.0, 154.0, 178.0, 0.0, 0.0, 0.0);

/** NAS-R
 */
const CDatum NAS_R("NAS-R", "N. American 1927 - San Salvador Island",
		6378206.400, 294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0,
		1.0, 140.0, 165.0, 0.0, 0.0, 0.0);

/** NAS-E
 */
const CDatum NAS_E("NAS-E", "N. American 1927 - Canada Mean Solution"
	" (including Newfoundland)", 6378206.400, 294.9786982, 0.0, 3986004.418,
		299792458.0, 7292115.0, -10.0, 158.0, 187.0, 0.0, 0.0, 0.0);

/** NAS-F
 */
const CDatum NAS_F("NAS-F", "N. American 1927 - Alberta & British Columbia",
		6378206.400, 294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0,
		-7.0, 162.0, 188.0, 0.0, 0.0, 0.0);

/** NAS-G
 */
const CDatum NAS_G("NAS-G", "N. American 1927 - Eastern Canada"
	" (Newfoundland, New Brunswick, Nova Scotia & Quebec)", 6378206.400,
		294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0, -22.0, 160.0,
		190.0, 0.0, 0.0, 0.0);

/** NAS-H
 */
const CDatum NAS_H("NAS-H", "N. American 1927 - Manitoba & Ontario",
		6378206.400, 294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0,
		-9.0, 157.0, 184.0, 0.0, 0.0, 0.0);

/** NAS-I
 */
const CDatum NAS_I("NAS-I", "N. American 1927 - Northwest Territories"
	" & Saskatchewan", 6378206.400, 294.9786982, 0.0, 3986004.418, 299792458.0,
		7292115.0, 4.0, 159.0, 188.0, 0.0, 0.0, 0.0);

/** NAS-J
 */
const CDatum NAS_J("NAS-J", "N. American 1927 - Yukon", 6378206.400,
		294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0, -7.0, 139.0,
		181.0, 0.0, 0.0, 0.0);

/** NAS-O
 */
const CDatum NAS_O("NAS-O", "N. American 1927 - Canal Zone", 6378206.400,
		294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0, 0.0, 125.0,
		201.0, 0.0, 0.0, 0.0);

/** NAS-P
 */
const CDatum NAS_P("NAS-P", "N. American 1927 - Caribbean", 6378206.400,
		294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0, -3.0, 142.0,
		183.0, 0.0, 0.0, 0.0);

/** NAS-N
 */
const CDatum NAS_N("NAS-N", "N. American 1927 - Central America", 6378206.400,
		294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0, 0.0, 125.0,
		194.0, 0.0, 0.0, 0.0);

/** NAS-T
 */
const CDatum NAS_T("NAS-T", "N. American 1927 - Cuba", 6378206.400,
		294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0, -9.0, 152.0,
		178.0, 0.0, 0.0, 0.0);

/** NAS-U
 */
const CDatum NAS_U("NAS-U", "N. American 1927 - Greenland (Hayes Peninsula)",
		6378206.400, 294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0,
		11.0, 114.0, 195.0, 0.0, 0.0, 0.0);

/** NAS-L
 */
const CDatum NAS_L("NAS-L", "N. American 1927 - Mexico", 6378206.400,
		294.9786982, 0.0, 3986004.418, 299792458.0, 7292115.0, -12.0, 130.0,
		190.0, 0.0, 0.0, 0.0);

#endif
